app/controllers/api/v1/trips_controller.rb

INSERT INTO `trips` (`user_id`, `starting_time`, `starting_latitude`, `starting_longitude`, `starting_address`, `created_at`, `updated_at`) VALUES (61, 1521866287, 5.770558260556129, -126.13112534352969, '934 Ankunding Inlet', '2018-03-08 16:31:37', '2018-03-08 16:31:37')
---
  def create
    @trip = Trip.new(trip_params)

    if @trip.save

UPDATE `trips` SET `starting_time` = 1522486776, `starting_latitude` = 29.297138255702876, `starting_longitude` = 13.996264834281078, `starting_address` = '48047 Altenwerth Isle' WHERE `trips`.`id` = 21
---
  def update
    if @trip.update(trip_params)

DELETE FROM `trips` WHERE `trips`.`id` = 41
---
  def destroy
    @trip.destroy

SELECT  `trips`.* FROM `trips` WHERE `trips`.`id` = 6601223306 LIMIT 1
---
    def set_trip
      @trip = Trip.find(params[:id])