app/controllers/api/v1/users_controller.rb

INSERT INTO `users` (`name`, `mobile`, `created_at`, `updated_at`) VALUES ('Emma Gorczany', '8604877057', '2018-03-08 16:18:20', '2018-03-08 16:18:20')
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE `users` SET `name` = 'Camren VonRueden Sr.', `mobile` = '6844974304' WHERE `users`.`id` = 26
---
  def update
    if @user.update(user_params)