app/controllers/trip_check_points_controller.rb

INSERT INTO `trip_check_points` (`trip_id`, `speed`, `latitude`, `longitude`, `user_id`, `created_at`, `updated_at`) VALUES (3, 100, 55.3, 14.2, 2, '2018-03-08 14:06:08', '2018-03-08 14:06:08')
---
  def create
    @trip_check_point = @trip.trip_check_points.build(trip_check_point_params)

    if @trip_check_point.save

SELECT  `trip_check_points`.* FROM `trip_check_points` WHERE `trip_check_points`.`id` = 2 LIMIT 1
---
    def set_trip_check_point
      @trip_check_point = TripCheckPoint.find(params[:id])

SELECT  `trips`.* FROM `trips` WHERE `trips`.`id` = 3 LIMIT 1
---
    def set_trip
      @trip = Trip.find(params[:trip_id])