app/controllers/trips_controller.rb

SELECT `trips`.* FROM `trips`
---
  def index
    @trips = Trip.all.includes(:user)

INSERT INTO `trips` (`user_id`, `starting_time`, `starting_latitude`, `starting_longitude`, `starting_address`, `created_at`, `updated_at`) VALUES (1, 1521376188, 55.3, 12.2, 'our home', '2018-03-08 12:52:05', '2018-03-08 12:52:05')
---
  def create
    @trip = Trip.new(trip_params)

    if @trip.save

UPDATE `trips` SET `current_status` = 1, `updated_at` = '2018-03-08 13:06:14' WHERE `trips`.`id` = 3
---
  def update
    if @trip.update(trip_params)

SELECT  `trips`.* FROM `trips` WHERE `trips`.`id` = 3 LIMIT 1
---
    def set_trip
      @trip = Trip.find(params[:id])