app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`name`, `mobile`, `created_at`, `updated_at`) VALUES ('Mateo Shanahan', '8777103693', '2018-03-08 16:12:01', '2018-03-08 16:12:01')

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `name` = 'Raphaelle Kerluke', `mobile` = '8127024013' WHERE `users`.`id` = 19